; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v7 - type_3 ?v2 - type_2)
 	      (pred_4 ?v8 - object ?v2 - type_2)
	      (pred_3 ?v7 - type_3 ?v5 - type_1)
	      (pred_2 ?v7 - type_3 ?v8 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v4 ?v3 - type_2)
       :precondition (and  (pred_1 ?v7 ?v4))
       :effect (and  (pred_1 ?v7 ?v3)
		     (not (pred_1 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_3 ?v1 - object ?v6 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_1 ?v7 ?v6) (pred_3 ?v7 ?v5))
       :effect (and (pred_2 ?v7 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_3 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_3 ?v1 - object ?v6 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v1 ?v5) (pred_1 ?v7 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_3 ?v7 ?v5)
		    (not (pred_2 ?v7 ?v1 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_3
obj_10 obj_06 - type_1
obj_03 obj_07 obj_05 obj_04 - type_2
obj_08 obj_01 obj_02 - object)
(:init
(pred_1 obj_09 obj_05)
(pred_3 obj_09 obj_10)
(pred_3 obj_09 obj_06)
(pred_4 obj_08 obj_03)
(pred_4 obj_01 obj_07)
(pred_4 obj_02 obj_03)
)
(:goal
(and
(pred_4 obj_08 obj_05)
(pred_4 obj_01 obj_07)
(pred_4 obj_02 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_06))))
)
)

; plan
1. (op_1 obj_09 obj_05 obj_03)
   deleted: (pred_1 obj_09 obj_05)
   added: (pred_1 obj_09 obj_03)
   goals met: 1 of 3
2. (op_3 obj_09 obj_08 obj_03 obj_10)
   deleted: (pred_4 obj_08 obj_03) (pred_3 obj_09 obj_10)
   added: (pred_2 obj_09 obj_08 obj_10)
   goals met: 1 of 3
3. (op_1 obj_09 obj_03 obj_05)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_05)
   goals met: 1 of 3
4. (op_2 obj_09 obj_08 obj_05 obj_10)
   deleted: (pred_2 obj_09 obj_08 obj_10)
   added: (pred_4 obj_08 obj_05) (pred_3 obj_09 obj_10)
   goals met: 2 of 3
5. (op_1 obj_09 obj_05 obj_03)
   deleted: (pred_1 obj_09 obj_05)
   added: (pred_1 obj_09 obj_03)
   goals met: 2 of 3
6. (op_3 obj_09 obj_02 obj_03 obj_10)
   deleted: (pred_4 obj_02 obj_03) (pred_3 obj_09 obj_10)
   added: (pred_2 obj_09 obj_02 obj_10)
   goals met: 2 of 3
7. (op_1 obj_09 obj_03 obj_04)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_04)
   goals met: 2 of 3
8. (op_2 obj_09 obj_02 obj_04 obj_10)
   deleted: (pred_2 obj_09 obj_02 obj_10)
   added: (pred_4 obj_02 obj_04) (pred_3 obj_09 obj_10)
   goals met: 3 of 3
